#+filetags: @journal
#+startup: overview
#+startup: hideblocks

* Недели
* Итоги года
** Общие впечатления о годе
** Топ-10 событий и достижений
** Впечатления о годе по месяцам
*** Январь
*** Февраль
*** Март
*** Апрель
*** Май
*** Июнь
*** Июль
*** Август
*** Сентябрь
*** Октябрь
*** Ноябрь
*** Декабрь
** Итоги по областям жизни
*** Земля -- Здоровье -- 土 -- 健全
**** Задекларированные цели на год
**** Что произошло за год
**** Твердые результаты
**** Изменения в процессах и поведении
**** Осознания и инсайты
**** Выводы по итогам года
**** Рекомендации на следующий год
*** Земля -- Защищенность -- 土 -- 保
**** Задекларированные цели на год
**** Что произошло за год
**** Твердые результаты
**** Изменения в процессах и поведении
**** Осознания и инсайты
**** Выводы по итогам года
**** Рекомендации на следующий год
*** Вода -- Инструменты -- 水 -- 用具
**** Задекларированные цели на год
**** Что произошло за год
**** Твердые результаты
**** Изменения в процессах и поведении
**** Осознания и инсайты
**** Выводы по итогам года
**** Рекомендации на следующий год
*** Вода -- Окружение -- 水 -- 環境
**** Задекларированные цели на год
**** Что произошло за год
**** Твердые результаты
**** Изменения в процессах и поведении
**** Осознания и инсайты
**** Выводы по итогам года
**** Рекомендации на следующий год
*** Огонь -- Развлечения -- 火 -- 趣味
**** Задекларированные цели на год
**** Что произошло за год
**** Твердые результаты
**** Изменения в процессах и поведении
**** Осознания и инсайты
**** Выводы по итогам года
**** Рекомендации на следующий год
*** Огонь -- Эмоции -- 火 -- 感情
**** Задекларированные цели на год
**** Что произошло за год
**** Твердые результаты
**** Изменения в процессах и поведении
**** Осознания и инсайты
**** Выводы по итогам года
**** Рекомендации на следующий год
*** Ветер -- Контакты -- 風 -- 連絡
**** Задекларированные цели на год
**** Что произошло за год
**** Твердые результаты
**** Изменения в процессах и поведении
**** Осознания и инсайты
**** Выводы по итогам года
**** Рекомендации на следующий год
*** Ветер -- Разум -- 風 -- 脳裏
**** Задекларированные цели на год
**** Что произошло за год
**** Твердые результаты
**** Изменения в процессах и поведении
**** Осознания и инсайты
**** Выводы по итогам года
**** Рекомендации на следующий год
*** Небо -- Творчество -- 空 -- 天才
**** Задекларированные цели на год
**** Что произошло за год
**** Твердые результаты
**** Изменения в процессах и поведении
**** Осознания и инсайты
**** Выводы по итогам года
**** Рекомендации на следующий год
** Динамика баланса сфер жизни
#+name: hotspots
| сфера | было | стало | изменение |
|-------+------+-------+-----------|
| 健全  |    0 |     0 |         0 |
| 保    |    0 |     0 |         0 |
| 用具  |    0 |     0 |         0 |
| 環境  |    0 |     0 |         0 |
| 趣味  |    0 |     0 |         0 |
| 感情  |    0 |     0 |         0 |
| 連絡  |    0 |     0 |         0 |
| 脳裏  |    0 |     0 |         0 |
| 天才  |    0 |     0 |         0 |
#+TBLFM: $4=$3-$2

#+begin_src elisp :var table=hotspots :colnames '("" "было" "стало")
  (let* ((past (sort (copy-sequence table) (lambda (x y) (> (second x) (second y)))))
         (past-first (first past))
         (past-last (first (last past)))
         (this (sort (copy-sequence table) (lambda (x y) (> (third x) (third y)))))
         (this-first (first this))
         (this-last (first (last this))))
    (message "%s" past)
    (message "%s" this)
    (list
     (list "лидирует" (first past-first) (first this-first))
     (list "отстает" (first past-last) (first this-last))
     (list "разбалансированность"
           (- (second past-first) (second past-last))
           (- (third this-first) (third this-last)))))
#+end_src

#+RESULTS:
|                      | было | стало |
|----------------------+------+-------|
| лидирует             | 健全 | 健全  |
| отстает              | 天才 | 天才  |
| разбалансированность | 0    | 0     |
** Стратегические вопросы
*** поменялись ли за год мои потребности
*** изменилось ли принятие решений
*** чего я уже не хочу из того, что хотел ранее
*** чего я больше не делаю по факту
*** куда я по факту направляю ресурсы
*** что изменилось в отношениях
*** что изменилось в моем окружении
*** какие проблемы беспокоили меня в прошедший год
*** что мне по факту нравится в моей сегодняшней жизни
*** чего я боюсь
*** чего я хочу
*** если я смогу за следующий год достигнуть чего-то одного, то чего
** Рекомендации на следующий год
